# Nettoyage

In [15]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

pd.set_option('display.max_columns', None)
pd.set_option('display.max_rows', None)

In [16]:
customers = pd.read_csv("./donnees/customers.csv")

products = pd.read_csv("./donnees/products.csv")

transactions = pd.read_csv("./donnees/transactions.csv")

# Fichier transactions

In [17]:
transactions.info()
transactions.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 679532 entries, 0 to 679531
Data columns (total 4 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   id_prod     679532 non-null  object
 1   date        679532 non-null  object
 2   session_id  679532 non-null  object
 3   client_id   679532 non-null  object
dtypes: object(4)
memory usage: 20.7+ MB

       id_prod                             date session_id client_id
count   679532                           679532     679532    679532
unique    3267                           679371     342316      8602
top      1_369  test_2021-03-01 02:30:02.237413        s_0    c_1609
freq      2252                               13        200     25488

On constate que dans le fichier transactions il y a une ligne qui revient a 200 reprises et qui semble etre une ligne de test.  
On va donc partir du principe que les lignes de tests seront supprimees dans les differents dataframes.

In [18]:
transaction_2 = transactions[transactions['date'].str.contains("test", case=False)]
print(transactions.shape)
print("Les client_id correspondant a des lignes de test sont:",transaction_2['client_id'].unique())
print("L'id_prod correspondant a une ligne de test est:",transaction_2['id_prod'].unique())

(679532, 4)
Les client_id correspondant a des lignes de test sont: ['ct_0' 'ct_1']
L'id_prod correspondant a une ligne de test est: ['T_0']

Nous gardons dans un coin les id client et l'id produit qui correspondent a des lignes de test.

In [19]:
# Suppression des lignes de test
transactions.drop(transactions[(transactions['date'].str.contains("test", case=False))].index, inplace=True)
transactions.shape

(679332, 4)

# Fichier customers

In [20]:
customers.info()
customers.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8623 entries, 0 to 8622
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   client_id  8623 non-null   object
 1   sex        8623 non-null   object
 2   birth      8623 non-null   int64
dtypes: int64(1), object(2)
memory usage: 202.2+ KB

             birth
count  8623.000000
mean   1978.280877
std      16.919535
min    1929.000000
25%    1966.000000
50%    1979.000000
75%    1992.000000
max    2004.000000

In [21]:

print("Il y a ",len(customers['client_id'].unique()), "valeurs uniques dans la colonne 'client_id', Chaque valeur est donc unique")

Il y a  8623 valeurs uniques dans la colonne 'client_id', Chaque valeur est donc unique

In [22]:
print("La colonne 'sex' ne contient que :" ,customers["sex"].unique())

La colonne 'sex' ne contient que : ['f' 'm']

In [23]:

customers.drop(customers[(customers['client_id'] == "ct_0")].index, inplace=True)
customers.drop(customers[(customers['client_id'] == "ct_1")].index, inplace=True)

Etant donne que nous avons trouves plus tot les id_clients correspondants a des lignes de tests nous pouvons les supprimer ici

# Fichier products

In [24]:
products.info()
products.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3287 entries, 0 to 3286
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id_prod  3287 non-null   object
 1   price    3287 non-null   float64
 2   categ    3287 non-null   int64
dtypes: float64(1), int64(1), object(1)
memory usage: 77.2+ KB

             price        categ
count  3287.000000  3287.000000
mean     21.856641     0.370246
std      29.847908     0.615387
min      -1.000000     0.000000
25%       6.990000     0.000000
50%      13.060000     0.000000
75%      22.990000     1.000000
max     300.000000     2.000000

On peut constater que la valeur min dans la colonne 'price 'est -1. c'est une valeure aberante.  
Mais on peut aussi voir qu'elle correspond a l'id_prod "T_0" qui est une ligne de test.  
On peut donc supprimer cette ligne.

In [25]:
product_test = products.loc[products['price'] == -1]
print(product_test)
products.drop(products[(products['id_prod'] == 'T_0')].index, inplace=True )
products.describe()

    id_prod  price  categ
731     T_0   -1.0      0

             price        categ
count  3286.000000  3286.000000
mean     21.863597     0.370359
std      29.849786     0.615446
min       0.620000     0.000000
25%       6.990000     0.000000
50%      13.075000     0.000000
75%      22.990000     1.000000
max     300.000000     2.000000

In [26]:
customers["age"]= 2022 - customers["birth"]
display(customers[:4])

  client_id sex  birth  age
0    c_4410   f   1967   55
1    c_7839   f   1975   47
2    c_1699   f   1984   38
3    c_5961   f   1962   60

In [27]:
new_customers = customers.to_csv(r"./donnees/new_customers.csv", index=False)
new_products = products.to_csv(r"./donnees/new_products.csv", index=False)
new_transactions = transactions.to_csv(r"./donnees/new_transactions.csv", index=False)